{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "bottom" : "input1",
      "alpha" : 0.55323946475982666,
      "operation" : 3,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "",
      "top" : "input1__fix__underflow_____Conv1",
      "type" : "elementwise",
      "name" : "Conv1__fix__underflow___",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "bn_Conv1_output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input1__fix__underflow_____Conv1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn_Conv1_output",
      "weights" : {
        "params_prelu" : 5
      },
      "mode" : 4,
      "debug_info" : "Conv1_relu",
      "top" : "Conv1_relu_output",
      "type" : "activation",
      "name" : "Conv1_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "expanded_conv_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_depthwise_BN_output",
      "blob_weights" : 9,
      "K" : 16,
      "blob_biases" : 7,
      "name" : "expanded_conv_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Conv1_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "expanded_conv_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 11
      },
      "mode" : 4,
      "debug_info" : "expanded_conv_depthwise_relu",
      "top" : "expanded_conv_depthwise_relu_output",
      "type" : "activation",
      "name" : "expanded_conv_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "expanded_conv_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_project_BN_output",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "expanded_conv_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "expanded_conv_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_1_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_expand_BN_output",
      "blob_weights" : 19,
      "K" : 8,
      "blob_biases" : 17,
      "name" : "block_1_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "expanded_conv_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_1_expand_BN_output",
      "weights" : {
        "params_prelu" : 21
      },
      "mode" : 4,
      "debug_info" : "block_1_expand_relu",
      "top" : "block_1_expand_relu_output",
      "type" : "activation",
      "name" : "block_1_expand_relu"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_1_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_1_depthwise_BN_output",
      "blob_weights" : 25,
      "K" : 48,
      "blob_biases" : 23,
      "stride_x" : 2,
      "name" : "block_1_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_1_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_1_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 27
      },
      "mode" : 4,
      "debug_info" : "block_1_depthwise_relu",
      "top" : "block_1_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_1_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_1_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_project_BN_output",
      "blob_weights" : 31,
      "K" : 48,
      "blob_biases" : 29,
      "name" : "block_1_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "block_1_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_2_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_expand_BN_output",
      "blob_weights" : 35,
      "K" : 8,
      "blob_biases" : 33,
      "name" : "block_2_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_1_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_2_expand_BN_output",
      "weights" : {
        "params_prelu" : 37
      },
      "mode" : 4,
      "debug_info" : "block_2_expand_relu",
      "top" : "block_2_expand_relu_output",
      "type" : "activation",
      "name" : "block_2_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_2_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_depthwise_BN_output",
      "blob_weights" : 41,
      "K" : 48,
      "blob_biases" : 39,
      "name" : "block_2_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_2_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_2_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 43
      },
      "mode" : 4,
      "debug_info" : "block_2_depthwise_relu",
      "top" : "block_2_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_2_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_2_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_project_BN_output",
      "blob_weights" : 47,
      "K" : 48,
      "blob_biases" : 45,
      "name" : "block_2_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "block_2_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_1_project_BN_output,block_2_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_2_add",
      "top" : "block_2_add_output",
      "type" : "elementwise",
      "name" : "block_2_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_3_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_expand_BN_output",
      "blob_weights" : 51,
      "K" : 8,
      "blob_biases" : 49,
      "name" : "block_3_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_2_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_3_expand_BN_output",
      "weights" : {
        "params_prelu" : 53
      },
      "mode" : 4,
      "debug_info" : "block_3_expand_relu",
      "top" : "block_3_expand_relu_output",
      "type" : "activation",
      "name" : "block_3_expand_relu"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_3_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_3_depthwise_BN_output",
      "blob_weights" : 57,
      "K" : 48,
      "blob_biases" : 55,
      "stride_x" : 2,
      "name" : "block_3_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_3_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_3_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 59
      },
      "mode" : 4,
      "debug_info" : "block_3_depthwise_relu",
      "top" : "block_3_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_3_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_3_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_project_BN_output",
      "blob_weights" : 63,
      "K" : 48,
      "blob_biases" : 61,
      "name" : "block_3_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_3_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_4_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_expand_BN_output",
      "blob_weights" : 67,
      "K" : 16,
      "blob_biases" : 65,
      "name" : "block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_4_expand_BN_output",
      "weights" : {
        "params_prelu" : 69
      },
      "mode" : 4,
      "debug_info" : "block_4_expand_relu",
      "top" : "block_4_expand_relu_output",
      "type" : "activation",
      "name" : "block_4_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_4_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_depthwise_BN_output",
      "blob_weights" : 73,
      "K" : 96,
      "blob_biases" : 71,
      "name" : "block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_4_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_4_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 75
      },
      "mode" : 4,
      "debug_info" : "block_4_depthwise_relu",
      "top" : "block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_4_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_4_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_project_BN_output",
      "blob_weights" : 79,
      "K" : 96,
      "blob_biases" : 77,
      "name" : "block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_4_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_3_project_BN_output,block_4_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_4_add",
      "top" : "block_4_add_output",
      "type" : "elementwise",
      "name" : "block_4_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_5_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_expand_BN_output",
      "blob_weights" : 83,
      "K" : 16,
      "blob_biases" : 81,
      "name" : "block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_4_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_5_expand_BN_output",
      "weights" : {
        "params_prelu" : 85
      },
      "mode" : 4,
      "debug_info" : "block_5_expand_relu",
      "top" : "block_5_expand_relu_output",
      "type" : "activation",
      "name" : "block_5_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_5_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_depthwise_BN_output",
      "blob_weights" : 89,
      "K" : 96,
      "blob_biases" : 87,
      "name" : "block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_5_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_5_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 91
      },
      "mode" : 4,
      "debug_info" : "block_5_depthwise_relu",
      "top" : "block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_5_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_5_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_project_BN_output",
      "blob_weights" : 95,
      "K" : 96,
      "blob_biases" : 93,
      "name" : "block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_5_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_4_add_output,block_5_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_5_add",
      "top" : "block_5_add_output",
      "type" : "elementwise",
      "name" : "block_5_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_6_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_6_expand_BN_output",
      "blob_weights" : 99,
      "K" : 16,
      "blob_biases" : 97,
      "name" : "block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_5_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_6_expand_BN_output",
      "weights" : {
        "params_prelu" : 101
      },
      "mode" : 4,
      "debug_info" : "block_6_expand_relu",
      "top" : "block_6_expand_relu_output",
      "type" : "activation",
      "name" : "block_6_expand_relu"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_6_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_6_depthwise_BN_output",
      "blob_weights" : 105,
      "K" : 96,
      "blob_biases" : 103,
      "stride_x" : 2,
      "name" : "block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_6_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 107
      },
      "mode" : 4,
      "debug_info" : "block_6_depthwise_relu",
      "top" : "block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_6_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_6_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_6_project_BN_output",
      "blob_weights" : 111,
      "K" : 96,
      "blob_biases" : 109,
      "name" : "block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_6_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_7_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_7_expand_BN_output",
      "blob_weights" : 115,
      "K" : 24,
      "blob_biases" : 113,
      "name" : "block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_6_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_7_expand_BN_output",
      "weights" : {
        "params_prelu" : 117
      },
      "mode" : 4,
      "debug_info" : "block_7_expand_relu",
      "top" : "block_7_expand_relu_output",
      "type" : "activation",
      "name" : "block_7_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_7_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_7_depthwise_BN_output",
      "blob_weights" : 121,
      "K" : 144,
      "blob_biases" : 119,
      "name" : "block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_7_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_7_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 123
      },
      "mode" : 4,
      "debug_info" : "block_7_depthwise_relu",
      "top" : "block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_7_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_7_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_7_project_BN_output",
      "blob_weights" : 127,
      "K" : 144,
      "blob_biases" : 125,
      "name" : "block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_7_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_6_project_BN_output,block_7_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_7_add",
      "top" : "block_7_add_output",
      "type" : "elementwise",
      "name" : "block_7_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_8_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_8_expand_BN_output",
      "blob_weights" : 131,
      "K" : 24,
      "blob_biases" : 129,
      "name" : "block_8_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_7_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_8_expand_BN_output",
      "weights" : {
        "params_prelu" : 133
      },
      "mode" : 4,
      "debug_info" : "block_8_expand_relu",
      "top" : "block_8_expand_relu_output",
      "type" : "activation",
      "name" : "block_8_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_8_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_8_depthwise_BN_output",
      "blob_weights" : 137,
      "K" : 144,
      "blob_biases" : 135,
      "name" : "block_8_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_8_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_8_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 139
      },
      "mode" : 4,
      "debug_info" : "block_8_depthwise_relu",
      "top" : "block_8_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_8_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_8_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_8_project_BN_output",
      "blob_weights" : 143,
      "K" : 144,
      "blob_biases" : 141,
      "name" : "block_8_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_8_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_7_add_output,block_8_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_8_add",
      "top" : "block_8_add_output",
      "type" : "elementwise",
      "name" : "block_8_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_9_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_9_expand_BN_output",
      "blob_weights" : 147,
      "K" : 24,
      "blob_biases" : 145,
      "name" : "block_9_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_8_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_9_expand_BN_output",
      "weights" : {
        "params_prelu" : 149
      },
      "mode" : 4,
      "debug_info" : "block_9_expand_relu",
      "top" : "block_9_expand_relu_output",
      "type" : "activation",
      "name" : "block_9_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_9_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_9_depthwise_BN_output",
      "blob_weights" : 153,
      "K" : 144,
      "blob_biases" : 151,
      "name" : "block_9_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_9_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 155
      },
      "mode" : 4,
      "debug_info" : "block_9_depthwise_relu",
      "top" : "block_9_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_9_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_9_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_9_project_BN_output",
      "blob_weights" : 159,
      "K" : 144,
      "blob_biases" : 157,
      "name" : "block_9_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_9_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_8_add_output,block_9_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_9_add",
      "top" : "block_9_add_output",
      "type" : "elementwise",
      "name" : "block_9_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_10_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_10_expand_BN_output",
      "blob_weights" : 163,
      "K" : 24,
      "blob_biases" : 161,
      "name" : "block_10_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_10_expand_BN_output",
      "weights" : {
        "params_prelu" : 165
      },
      "mode" : 4,
      "debug_info" : "block_10_expand_relu",
      "top" : "block_10_expand_relu_output",
      "type" : "activation",
      "name" : "block_10_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_10_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_10_depthwise_BN_output",
      "blob_weights" : 169,
      "K" : 144,
      "blob_biases" : 167,
      "name" : "block_10_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_10_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_10_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 171
      },
      "mode" : 4,
      "debug_info" : "block_10_depthwise_relu",
      "top" : "block_10_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_10_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_10_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_10_project_BN_output",
      "blob_weights" : 175,
      "K" : 144,
      "blob_biases" : 173,
      "name" : "block_10_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "block_10_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_11_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_11_expand_BN_output",
      "blob_weights" : 179,
      "K" : 32,
      "blob_biases" : 177,
      "name" : "block_11_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "block_10_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_11_expand_BN_output",
      "weights" : {
        "params_prelu" : 181
      },
      "mode" : 4,
      "debug_info" : "block_11_expand_relu",
      "top" : "block_11_expand_relu_output",
      "type" : "activation",
      "name" : "block_11_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_11_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_11_depthwise_BN_output",
      "blob_weights" : 185,
      "K" : 192,
      "blob_biases" : 183,
      "name" : "block_11_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "block_11_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_11_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 187
      },
      "mode" : 4,
      "debug_info" : "block_11_depthwise_relu",
      "top" : "block_11_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_11_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_11_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_11_project_BN_output",
      "blob_weights" : 191,
      "K" : 192,
      "blob_biases" : 189,
      "name" : "block_11_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "block_11_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_10_project_BN_output,block_11_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_11_add",
      "top" : "block_11_add_output",
      "type" : "elementwise",
      "name" : "block_11_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_12_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_12_expand_BN_output",
      "blob_weights" : 195,
      "K" : 32,
      "blob_biases" : 193,
      "name" : "block_12_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "block_11_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_12_expand_BN_output",
      "weights" : {
        "params_prelu" : 197
      },
      "mode" : 4,
      "debug_info" : "block_12_expand_relu",
      "top" : "block_12_expand_relu_output",
      "type" : "activation",
      "name" : "block_12_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_12_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_12_depthwise_BN_output",
      "blob_weights" : 201,
      "K" : 192,
      "blob_biases" : 199,
      "name" : "block_12_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "block_12_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_12_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 203
      },
      "mode" : 4,
      "debug_info" : "block_12_depthwise_relu",
      "top" : "block_12_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_12_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_12_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_12_project_BN_output",
      "blob_weights" : 207,
      "K" : 192,
      "blob_biases" : 205,
      "name" : "block_12_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "block_12_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_11_add_output,block_12_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_12_add",
      "top" : "block_12_add_output",
      "type" : "elementwise",
      "name" : "block_12_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_13_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_13_expand_BN_output",
      "blob_weights" : 211,
      "K" : 32,
      "blob_biases" : 209,
      "name" : "block_13_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "block_12_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_13_expand_BN_output",
      "weights" : {
        "params_prelu" : 213
      },
      "mode" : 4,
      "debug_info" : "block_13_expand_relu",
      "top" : "block_13_expand_relu_output",
      "type" : "activation",
      "name" : "block_13_expand_relu"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_13_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_13_depthwise_BN_output",
      "blob_weights" : 217,
      "K" : 192,
      "blob_biases" : 215,
      "stride_x" : 2,
      "name" : "block_13_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "block_13_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_13_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 219
      },
      "mode" : 4,
      "debug_info" : "block_13_depthwise_relu",
      "top" : "block_13_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_13_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_13_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_13_project_BN_output",
      "blob_weights" : 223,
      "K" : 192,
      "blob_biases" : 221,
      "name" : "block_13_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 56,
      "bottom" : "block_13_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_14_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_14_expand_BN_output",
      "blob_weights" : 227,
      "K" : 56,
      "blob_biases" : 225,
      "name" : "block_14_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 336,
      "bottom" : "block_13_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_14_expand_BN_output",
      "weights" : {
        "params_prelu" : 229
      },
      "mode" : 4,
      "debug_info" : "block_14_expand_relu",
      "top" : "block_14_expand_relu_output",
      "type" : "activation",
      "name" : "block_14_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_14_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_14_depthwise_BN_output",
      "blob_weights" : 233,
      "K" : 336,
      "blob_biases" : 231,
      "name" : "block_14_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 336,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 336,
      "bottom" : "block_14_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_14_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 235
      },
      "mode" : 4,
      "debug_info" : "block_14_depthwise_relu",
      "top" : "block_14_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_14_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_14_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_14_project_BN_output",
      "blob_weights" : 239,
      "K" : 336,
      "blob_biases" : 237,
      "name" : "block_14_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 56,
      "bottom" : "block_14_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_13_project_BN_output,block_14_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_14_add",
      "top" : "block_14_add_output",
      "type" : "elementwise",
      "name" : "block_14_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_15_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_15_expand_BN_output",
      "blob_weights" : 243,
      "K" : 56,
      "blob_biases" : 241,
      "name" : "block_15_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 336,
      "bottom" : "block_14_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_15_expand_BN_output",
      "weights" : {
        "params_prelu" : 245
      },
      "mode" : 4,
      "debug_info" : "block_15_expand_relu",
      "top" : "block_15_expand_relu_output",
      "type" : "activation",
      "name" : "block_15_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_15_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_15_depthwise_BN_output",
      "blob_weights" : 249,
      "K" : 336,
      "blob_biases" : 247,
      "name" : "block_15_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 336,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 336,
      "bottom" : "block_15_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_15_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 251
      },
      "mode" : 4,
      "debug_info" : "block_15_depthwise_relu",
      "top" : "block_15_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_15_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_15_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_15_project_BN_output",
      "blob_weights" : 255,
      "K" : 336,
      "blob_biases" : 253,
      "name" : "block_15_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 56,
      "bottom" : "block_15_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_14_add_output,block_15_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "block_15_add",
      "top" : "block_15_add_output",
      "type" : "elementwise",
      "name" : "block_15_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_16_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_16_expand_BN_output",
      "blob_weights" : 259,
      "K" : 56,
      "blob_biases" : 257,
      "name" : "block_16_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 336,
      "bottom" : "block_15_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_16_expand_BN_output",
      "weights" : {
        "params_prelu" : 261
      },
      "mode" : 4,
      "debug_info" : "block_16_expand_relu",
      "top" : "block_16_expand_relu_output",
      "type" : "activation",
      "name" : "block_16_expand_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_16_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_16_depthwise_BN_output",
      "blob_weights" : 265,
      "K" : 336,
      "blob_biases" : 263,
      "name" : "block_16_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 336,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 336,
      "bottom" : "block_16_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "block_16_depthwise_BN_output",
      "weights" : {
        "params_prelu" : 267
      },
      "mode" : 4,
      "debug_info" : "block_16_depthwise_relu",
      "top" : "block_16_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_16_depthwise_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block_16_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_16_project_BN_output",
      "blob_weights" : 271,
      "K" : 336,
      "blob_biases" : 269,
      "name" : "block_16_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "block_16_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv_1_bn_output",
      "blob_weights" : 275,
      "K" : 112,
      "blob_biases" : 273,
      "name" : "Conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1280,
      "bottom" : "block_16_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "Conv_1_bn_output",
      "weights" : {
        "params_prelu" : 277
      },
      "mode" : 4,
      "debug_info" : "out_relu",
      "top" : "out_relu_output",
      "type" : "activation",
      "name" : "out_relu"
    },
    {
      "pad_r" : 0,
      "debug_info" : "global_average_pooling2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 7,
      "is_global" : 1,
      "top" : "global_average_pooling2d_2_output",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "global_average_pooling2d_2",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "out_relu_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 7,
      "pad_value" : 0
    },
    {
      "has_prelu" : 0,
      "top" : "output1",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 136,
      "blob_weights" : 281,
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "global_average_pooling2d_2_output",
      "debug_info" : "lms",
      "has_tanh" : 0,
      "blob_biases" : 279,
      "name" : "lms",
      "nB" : 1280
    },
    {
      "nB" : 1280,
      "top" : "detector_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 285,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "global_average_pooling2d_2_output",
      "blob_biases" : 283,
      "has_tanh" : 0,
      "debug_info" : "detector",
      "name" : "detector",
      "has_prelu" : 0
    },
    {
      "bottom" : "detector_output",
      "attributes" : {
        "is_output" : 1
      },
      "weights" : {

      },
      "debug_info" : "detector__activation__",
      "top" : "output2",
      "C" : 2,
      "type" : "softmax",
      "name" : "detector__activation__"
    }
  ]
}