<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/frx_neural.h</key>
		<data>
		up9XixCndr7S623kpAJEABmZa9A=
		</data>
		<key>Headers/frx_neural_api.h</key>
		<data>
		VGjewE+c1cJrMmWsXjL03uulov4=
		</data>
		<key>Info.plist</key>
		<data>
		wsqK1/dHlJxrOJXNZfT8cpAI0p4=
		</data>
		<key>MoMoFRX/edgetopology1.ef</key>
		<data>
		ufpbz4aKYfmyywMbls/p5xLMYqA=
		</data>
		<key>MoMoFRX/edgetopology1.ev</key>
		<data>
		nNf/zUEKgKw/fDIgoS5RaQKe/YA=
		</data>
		<key>MoMoFRX/head.3308.DA.c30.tm.pca2.86.blendshapes</key>
		<data>
		OCbRAyN8pj96mVptXJtcTw9TYJQ=
		</data>
		<key>MoMoFRX/head.3308.DA.c30.tm.pca2.86.means</key>
		<data>
		wtEika1+SAz1mQcH588cmbu+pcw=
		</data>
		<key>MoMoFRX/head.verts</key>
		<data>
		HOEf8rdA3XmmDGJCPSYSA0py55A=
		</data>
		<key>MoMoFRX/head1.triangles</key>
		<data>
		s5VdwtnJVu1kRh51Jnn5BjQC4LI=
		</data>
		<key>MoMoFRX/head_au.tex</key>
		<data>
		p3snmjZUD9hVGCtVEsvRCS7hXgg=
		</data>
		<key>MoMoFRX/head_low_poly.triangles</key>
		<data>
		aeJuNebSZ73UYBw+oGlaAw2uIwA=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		UojSiUGblpMmdKELQu+7sMK5ALw=
		</data>
		<key>coreMLFRXPrior.mlmodelc/analytics/coremldata.bin</key>
		<data>
		6298tICppFWePAOkYBC/dRIOEtU=
		</data>
		<key>coreMLFRXPrior.mlmodelc/coremldata.bin</key>
		<data>
		57JeTqxwTyTRhGYBw8RRzjZRJ68=
		</data>
		<key>coreMLFRXPrior.mlmodelc/metadata.json</key>
		<data>
		PCN9Qdy24vHETKfvge1c5Er1GOI=
		</data>
		<key>coreMLFRXPrior.mlmodelc/model.espresso.net</key>
		<data>
		Qd7fjR4hSIQVbXgo4yaLJuNmj3Y=
		</data>
		<key>coreMLFRXPrior.mlmodelc/model.espresso.shape</key>
		<data>
		foP1WTNOHpkJXQBwbnLYZ0ue7ks=
		</data>
		<key>coreMLFRXPrior.mlmodelc/model.espresso.weights</key>
		<data>
		c6TGfXjjMf4B/Yp5hcb07140WWM=
		</data>
		<key>coreMLFRXPrior.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>coreMLFRXPrior.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>coreMLLandmarks128.mlmodelc/analytics/coremldata.bin</key>
		<data>
		PlUovfpBhVtKuAN+9gEQz0EG+9g=
		</data>
		<key>coreMLLandmarks128.mlmodelc/coremldata.bin</key>
		<data>
		BwszueCeqTSxDWByYZttCGh47vE=
		</data>
		<key>coreMLLandmarks128.mlmodelc/metadata.json</key>
		<data>
		HnlEafivAvrqdC2yTDlULxRFd9I=
		</data>
		<key>coreMLLandmarks128.mlmodelc/model.espresso.net</key>
		<data>
		YJ4gkYLWHTEmX5wo6mmPFNaAWIw=
		</data>
		<key>coreMLLandmarks128.mlmodelc/model.espresso.shape</key>
		<data>
		fQlDiAdLMovpdYBowwkuPV+6CnY=
		</data>
		<key>coreMLLandmarks128.mlmodelc/model.espresso.weights</key>
		<data>
		S4Az6PdTUV5H88b3yiYiH6sc1FI=
		</data>
		<key>coreMLLandmarks128.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>coreMLLandmarks128.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>coreMLLandmarks224.mlmodelc/analytics/coremldata.bin</key>
		<data>
		nww+MsUSjNDfq5mISkslPzJ4opQ=
		</data>
		<key>coreMLLandmarks224.mlmodelc/coremldata.bin</key>
		<data>
		cIQhhRqMoxwtUC1XAqYenFHtUHM=
		</data>
		<key>coreMLLandmarks224.mlmodelc/metadata.json</key>
		<data>
		Cub6lfthwBiupLZKi43M0PYF/J8=
		</data>
		<key>coreMLLandmarks224.mlmodelc/model.espresso.net</key>
		<data>
		7fwGH9gnc2X/ZU/9f9ahOjQ6Cu0=
		</data>
		<key>coreMLLandmarks224.mlmodelc/model.espresso.shape</key>
		<data>
		iXb9CnligGhsuf/Ki0FCU6MSpXM=
		</data>
		<key>coreMLLandmarks224.mlmodelc/model.espresso.weights</key>
		<data>
		LqgwP7C8EoY/nBL+3/88avXbDbc=
		</data>
		<key>coreMLLandmarks224.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>coreMLLandmarks224.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>coreMLSSD.mlmodelc/analytics/coremldata.bin</key>
		<data>
		6a3dLwXUpUVk8Gf5+/i9s/AhkCk=
		</data>
		<key>coreMLSSD.mlmodelc/coremldata.bin</key>
		<data>
		QAkvzSa33JPJosV2zszavLcJ0C4=
		</data>
		<key>coreMLSSD.mlmodelc/metadata.json</key>
		<data>
		82g6sRla8QSET6EmKeG/N64/Kvs=
		</data>
		<key>coreMLSSD.mlmodelc/model.espresso.net</key>
		<data>
		IKs7vlRqwBfeAtK6/23Wv6fsiBY=
		</data>
		<key>coreMLSSD.mlmodelc/model.espresso.shape</key>
		<data>
		pV525nLI4u1lYVtladdnHS/707U=
		</data>
		<key>coreMLSSD.mlmodelc/model.espresso.weights</key>
		<data>
		fkR/A4Xq5UzzSxCttdhU+BMZmrE=
		</data>
		<key>coreMLSSD.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>coreMLSSD.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/frx_neural.h</key>
		<dict>
			<key>hash2</key>
			<data>
			YGeTwZTar3+HB72X81mGCteRpr/Lqo+48xhJc7NrTHk=
			</data>
		</dict>
		<key>Headers/frx_neural_api.h</key>
		<dict>
			<key>hash2</key>
			<data>
			k7vr51+E+gcn1rorLY7kJXzDvTCB60kx9Sjq5U4jm28=
			</data>
		</dict>
		<key>MoMoFRX/edgetopology1.ef</key>
		<dict>
			<key>hash2</key>
			<data>
			zbWHaMHNdoNYNS96pw7OyA1Sv75gnHWn82T6fkw2nSQ=
			</data>
		</dict>
		<key>MoMoFRX/edgetopology1.ev</key>
		<dict>
			<key>hash2</key>
			<data>
			yIxaOiO39XmEZUUEEZCNWaj4A4Zl6T4EKpu4hxTD2KE=
			</data>
		</dict>
		<key>MoMoFRX/head.3308.DA.c30.tm.pca2.86.blendshapes</key>
		<dict>
			<key>hash2</key>
			<data>
			GgNUeR6aXW/lnnHfUiBhNR+2HKYVfO0ks32BalR8dCc=
			</data>
		</dict>
		<key>MoMoFRX/head.3308.DA.c30.tm.pca2.86.means</key>
		<dict>
			<key>hash2</key>
			<data>
			VtP/yCds3t6Gav5kJ/u6XC9Tjt0oHbolqwWvc9fDTuw=
			</data>
		</dict>
		<key>MoMoFRX/head.verts</key>
		<dict>
			<key>hash2</key>
			<data>
			SAfRyOedlG/PYlDqicMnH2cXK8uJX31UlrN1b1JQGzQ=
			</data>
		</dict>
		<key>MoMoFRX/head1.triangles</key>
		<dict>
			<key>hash2</key>
			<data>
			4g9B83KO6APPMsYD2lADCUYYu2BdQn62jzs4KBCuQ/M=
			</data>
		</dict>
		<key>MoMoFRX/head_au.tex</key>
		<dict>
			<key>hash2</key>
			<data>
			vKlkhXcLSwPzAx8epKwQyVPS3utvtFo5hBRTTgp4E54=
			</data>
		</dict>
		<key>MoMoFRX/head_low_poly.triangles</key>
		<dict>
			<key>hash2</key>
			<data>
			qJqvYucd57nBPZq4oOQLasIxrYJQ6QiDBbdmNpXZTTg=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			V5+cryd12nzN7xsYkUhzE0QUL7MEg7EYMNfxcdqsJPc=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			SNxuMpK1a5vBC2Yc6z+stx+Bx0bF9Lo+DNQvPoBlNMU=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			+Z9u/nxmMM6wjRteZXyKVCrTPKdhC7FFfu/1nJJoDN8=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			qr8HxAo7ax/AllSizJSy3Y3E5b2Nw+KSKSdrly0gH98=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			d0j1eF0BGnIU2N/B5H/IDnzcE68uweZ2kFECP+znipU=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			U2InECdTQ7yGJXVwFPY4OaTj5hINEd1yptB8oMLV4yQ=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			KBdI5PqJC7QgaNwTTcITcTDK/wfout9Qpt7CLo06Dc0=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>coreMLFRXPrior.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JTid75t/2WgwMnk9IJJ1MfkR767DmsM5kRWBPMVK1q0=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			ctf5tO8nHIAXyDcX6NFdtSY0nGmDOwnFRqHuK90EcdQ=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			wyp3D//7X4av85c9pfzi1vNJZnGVaxrIaOGvOPW8PA8=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Yr7jpTdzNGAnNgCWAxcSwBsPF7OeYhIhoJsAU1IJ2tk=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			qJk0E7hXPBKBkGQgGOJwHmh3f4ysn3EsHzGcaEYXjx0=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			KP+mVuzjxWJGfNZk2xNNF5sQ/Xs/l74NxrmitXB1tvY=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>coreMLLandmarks128.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			2p+KoZd8daWPwdHTgymmnEOrpoeMcqF6h63HzAXFPBM=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5ud1jGxlR6dj0EC0SXrC+STRaKlxsMQR7fKfVv6AJB8=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			5MnfG0i64u1N8cVzxOzKce3ecTRibhD/Y9PqLgYY3Co=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			PkUpthN2gz1lGClGqoiKuk1YDtsc7xkn58+DXQ5lzfE=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			7R322U9yCXZFAk9GIz7i2xW9Z4f/4c8EltEMHWUxPUs=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			pQ2h6h1ySToHgtS/BSJLWbCFm4yKJqITis9WdRzBxHM=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>coreMLLandmarks224.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			GZH/tFeylV2QJ4t5QP5DPW4T9bXWan2OK/vGrnPj79A=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			ki5hnc778oZEFrJhdRgyzkssKhvJEH8LS2ZsgAd32/0=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			LvMJcFahqGH8PDEwOyq+zsfm8nbxK0oD+YSMy7M6ULY=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			44JE/keojRTWS4xm/7AAYkvmtLmh6X46ULoV3F3g+Q0=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			LnipH9HMji3+QIB86pFT5LzOcxoFzPcaVdBSfs0GZfw=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			BjF31U0pceg4s0p8AMvs9Rf9mAB+yg3/0bEFnTFH/Uk=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>coreMLSSD.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
